

// console.log("Hello world")// вывод текста в консоль файла

// let string = "alloha" //строковый тип данных

// //let неявное обьявление переменной
// //string- имя переменной
// //= - это присвоение значния перменной
// //"aloha" - значение переменной

// alert(string) //всплывающее окно на сайте//


// let integer = 10 //целчисленный тип данных

// console.log(integer)//вывод текста в коноль сайта


// let float = 100.52  //число с плавающей точкой
// let boolean = true //=false



// 1 ЗАДАНИЕ

// ***************************************************************

// let num = prompt("Введите число для возведения в квадрат")

// //во внутрь переменной num передаем функцию prompt

// num = num **2

// //сложенние (num = num +1) - значение перменной увеличивается на 1
// //вычитание (num = num -1) - значение переменной уменьшается на 1
// //умножение (num = num*1)...умножится на 1
// //деление (num = num/1) -значение ...делится на 1




// //мы измнили переменную num и возвели её значение в квадрат (во вторую степень)
// alert(num)



//2 ЗАДАНИЕ
// ******************************************************************


// let num_First = Number(prompt("Введите первое число")) 
// let num_Second = Number( prompt("Введите второе число"))

// sum = num_First + num_Second
// alert(sum)

// let mid =(num_First + num_Second) / 2

// alert(mid)




//3 ЗВАДАНИЕ
// *****************************************************************************

let num = Number (prompt("Введите длину стороны квадрата"))

num **= 2

alert(num)












